Revit 2027 API
FileImportedEventArgs Properties
The FileImportedEventArgs type exposes the following members.
Properties
Name | Description
Cancellable |  Indicates whether an event may be cancelled by an event delegate.
(Inherited from RevitAPIEventArgs)
Document |  The document associated with the event.
(Inherited from RevitAPIPostDocEventArgs)
Format |  Identifies the import format, e.g. DWG or image.
ImportedInstanceId |  The ElementId of the imported instance that represents the imported object(s) after a successful import. It could be used for further manipulation of that instance.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from RevitAPIEventArgs)
Path |  Path of the source file that was imported.
Status |  Indicates whether the action associated with this event succeeded, failed, or was cancelled (by an API event handler).
(Inherited from RevitAPIPostEventArgs)
Top
See Also
Reference
FileImportedEventArgs Class
Autodesk.Revit.DB.Events Namespace